<?php
/* $a = 0;
$b = 0;
for ($i = 0; $i <= 5; $i++) {
 $a += 10;
 $b += 5;
 echo " На этапе ". $i ." значение a = " . $a . ", а значение b = " . $b."<br/ >";
}
echo "\n Конец цикла,  значение a = " . $a . ", а значение b = " . $b;
*/

// $a = 0;
// $b = 0;
// $i = 0;
// while ($i <= 5) {
//  $a += 10;
//  $b += 5;
//  echo " На этапе ". $i ." значение a = " . $a . ", а значение b = " . $b."<br/ >";
//  $i++;
// }
// echo "\n Конец цикла while,  значение a = " . $a . ", а значение b = " . $b;


$arr = [];

for ($i = 0; $i < 10; $i++) {
    $arr[$i] = rand(0, 100);
}
echo '<pre>';
print_r($arr); 
echo '</pre>';
